src/Documents/ПочтовоеСообщение/ПочтовоеСообщение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПочтовоеСообщение</name>
  <posting>Deny</posting>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПочтовыеСообщенияИсходящие/ПочтовыеСообщенияИсходящие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеСообщенияИсходящие</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПочтовоеСообщение</name>
    <type>
      <types>DocumentRef.ПочтовоеСообщение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПочтовоеСообщение/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МассивСтрок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПочтовыеСообщенияИсходящие.Отправлено КАК Отправлено,
	|	ПочтовыеСообщенияИсходящие.СообщениеОбОшибке КАК СообщениеОбОшибке,
	|	ПочтовыеСообщенияИсходящие.Дата КАК Дата,
	|	ПочтовыеСообщенияИсходящие.КоличествоПопыток КАК КоличествоПопыток
	|ИЗ
	|	РегистрСведений.ПочтовыеСообщенияИсходящие КАК ПочтовыеСообщенияИсходящие
	|ГДЕ
	|	ПочтовыеСообщенияИсходящие.ПочтовоеСообщение = &ПочтовоеСообщение";
	
	Запрос.УстановитьПараметр("ПочтовоеСообщение", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.Отправлено Тогда
			
			Цвет = WebЦвета.ТемноЗеленый;
		    СтрокаСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сообщение отправлено ""%1""'"), ВыборкаДетальныеЗаписи.Дата);
			
		Иначе
			
			Цвет = WebЦвета.Красный;
		    СтрокаСостояния = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сообщение не отправлено! Дата последней попытки ""%1"", количество попыток ""%2"", по причине ""%3""'"), 
			ВыборкаДетальныеЗаписи.Дата, ВыборкаДетальныеЗаписи.КоличествоПопыток, ВыборкаДетальныеЗаписи.СообщениеОбОшибке);
			
		КонецЕсли;
		
		ФССтрокаСостояния = Новый ФорматированнаяСтрока(СтрокаСостояния, , Цвет); 		
		МассивСтрок.Добавить(ФССтрокаСостояния);
		
	Иначе
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Сообщение не отправлено!'"),,WebЦвета.Красный));

	КонецЕсли;		
	
	ИнформацияОбОтправкеПисьма = Новый ФорматированнаяСтрока(МассивСтрок);	
	
КонецПроцедуры  //ПриЧтенииНаСервере
